[
{"major": "CPT_S", "name": ["101  Introduction to Electrical Engineering and Computer Science"], "description": "1   Introduction to programs within the School of Electrical Engineering and Computer Science discussing resources, opportunities, and knowledge and skills necessary to succeed within EECS majors. Typically offered Fall and Spring."},
{"major": "CPT_S", "name": ["111 [QUAN]  Introduction to Computer Programming"], "description": "3 (2-3)    Elementary algorithmic problem solving, computational models, sequential, iterative and conditional operations, parameterized procedures, array and list structures and basic efficiency analysis. Typically offered Fall and Spring.", "prereq": " MATH 101 with a C or better, MATH 103 with a C or better, or higher level MATH course with a C or better, or a minimum ALEKS math placement score of 45%"},
{"major": "CPT_S", "name": ["121  Program Design and Development C/C++"], "description": "4 (3-3)   Formulation of problems and top-down design of programs in a modern structured language (C/C++) for their solution on a digital computer. Typically offered Fall, Spring, and Summer.", "prereq": "MATH 108, 171, 172, 182, 201, 202, 206, or 220, each with a C or better, CPT S 111 with a B+ or better, a min ALEKS math placement score of 78%, or by permission with an AP Exam in Cpt S Principles or Cpt Sci A with a 4 or better"},
{"major": "CPT_S", "name": ["122  Data Structures C/C++"], "description": "4 (3-3)   Advanced programming techniques: data structures, recursion, sorting and searching, and basics of algorithm analysis taught in C/C++ programming language. Typically offered Fall, Spring, and Summer.", "prereq": "CPT S 121 with a C or better"},
{"major": "CPT_S", "name": ["131  Program Design and Development Java"], "description": "4 (3-3)   Formulation of problems and top-down design of programs in a modern structured language for their solution on a digital computer. Taught in Java programming language. Typically offered Fall and Spring.", "prereq": "MATH 108, 171, 172, 182, 201, 202, 206, or 220, each with a C or better, CPT S 111 with a B+ or better, a min ALEKS math placement score of 78%, or by permission with an AP Exam in Cpt S Principles or Cpt Sci A with a 4 or better"},
{"major": "CPT_S", "name": ["132  Data Structures Java"], "description": "4 (3-3)   Advanced programming techniques: data structures, recursion, sorting and searching, and basics of algorithm analysis. Taught in Java programming language. Typically offered Fall and Spring.", "prereq": "CPT S 131 with a C or better"},
{"major": "CPT_S", "name": ["215  Data Analytics Systems and Algorithms"], "description": "3   Exploration of fundamental concepts, constructs, and techniques of modern data analytics systems. (Crosslisted course offered as CPT S 215, CS 215).", "prereq": "CPT S 122, CPT S 132, or CS 122"},
{"major": "CPT_S", "name": ["223  Advanced Data Structures C/C++"], "description": "3   Advanced data structures, object oriented programming concepts, concurrency, and program design principles taught in C/C++ programming language. Typically offered Fall and Spring.", "prereq": "CPT S 122 with a C or better; MATH 216 with a C or better or concurrent enrollment"},
{"major": "CPT_S", "name": ["224  Programming Tools"], "description": "2   Debugging tools, scripting languages, UNIX programming tools. Typically offered Fall.", "prereq": "CPT S 122 with a C or better, or CPT S 132 with a C or better"},
{"major": "CPT_S", "name": ["233  Advanced Data Structures Java"], "description": "3   Advanced data structures, object oriented programming concepts, concurrency, and program design principles. Taught in Java programming language. Typically offered Fall and Spring.", "prereq": "CPT S 132 with a C or better; MATH 216 with a C or better or concurrent enrollment"},
{"major": "CPT_S", "name": ["260  Introduction to Computer Architecture"], "description": "3    Computer systems architecture; logic, data representation, assembly language, memory organization and trends. Typically offered Fall and Spring.", "prereq": "CPT S 223 with a C or better or concurrent enrollment, or CPT S 233 with a C or better or concurrent enrollment"},
{"major": "CPT_S", "name": ["302  Professional Skills in Computing and Engineering"], "description": "3   Foundation in computing and engineering professional development.  (Crosslisted course offered as CPT S 302, E E 302).  Credit not granted for both CPT S/E E 302 and CPT S 401. Typically offered Fall and Spring.", "prereq": "CPT S 122 or 132, OR CPT S 121 or 131 and E E 261; admitted to a major in EECS or Data Analytics; junior standing"},
{"major": "CPT_S", "name": ["315  Introduction to Data Mining"], "description": "3   The process of automatically extracting valid, useful, and previously unknown information from large repositories. (Crosslisted course offered as CPT S 315, CS 315).  Recommended preparation: prior Python programming.", "prereq": "CPT S 215, 223, 233, or CS 215, with a C or better; admitted to the major or minor in Computer Science, Computer Engineering, Electrical Engineering, Software Engineering, Data Analytics, or Cybersecurity"},
{"major": "CPT_S", "name": ["317  Automata and Formal Languages"], "description": "3    Finite automata, regular sets, pushdown automata, context-free language, Turing machines and the halting problem. Typically offered Fall and Spring.", "prereq": "CPT S 122 or 132, with a C or better; MATH 216 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["321  Object-Oriented Software Principles"], "description": "3   Object-oriented programming for flexibility, efficiency, and maintainability; logic and UI decoupling; complexity analysis, data structures, and algorithms for industry-quality software.", "prereq": "CPT S 223 or 233, with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["322 [M]  Software Engineering Principles I"], "description": "3    Introduction to software engineering; requirements analysis, definition, specification including formal methods; prototyping; design including object and function oriented design. Typically offered Fall and Spring.", "prereq": "CPT S 215, 223, or 233, with a C or better; admitted to a major or minor in EECS or Data Analytics, or major in Neuroscience"},
{"major": "CPT_S", "name": ["323  Software Design"], "description": "3   Enrollment not allowed if credit earned in CPT S 487.  Practical aspects of software design and implementation using object-oriented, aspect-oriented and procedural programming. Credit not granted for both CPT S 323 and 487. Typically offered Spring.", "prereq": "CPT S 223 or 233, with a C or better; CPT S 322 with a C or better or concurrent enrollment; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["327  Fundamentals of Cyber Security and Cryptography"], "description": "3   Security and privacy principles in modern computers and network communications covering various security protection mechanisms, including cryptography, secure communication protocols, and anonymity techniques. Typically offered Fall and Spring.", "prereq": "CPT S 223 or 233 with a C or better; CPT S 260 or E E 234 with a C or better; CPT S 360 or 370 with a C or better or concurrent enrollment; MATH 216 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["350  Design and Analysis of Algorithms"], "description": "3    Analysis of data structures and algorithms; computational complexity and design of efficient data-handling procedures.", "prereq": "CPT S 215, 223, or 233, with a C or better; CPT S 317 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["355  Programming Language Design"], "description": "3    Design concepts of high-level programming languages; survey of existing languages, experience using some languages. Typically offered Fall and Spring.", "prereq": "CPT S 223 or 233, with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["360  Systems Programming C/C++"], "description": "4 (3-3)   Implementation of systems programs, concepts of computer operating systems; laboratory experience in using operating system facilities taught in C/C++ programming language. Typically offered Fall and Spring.", "prereq": "CPT S 223 with a C or better; CPT S 260 with a C or better or E E 234 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["370  Systems Programming Java"], "description": "4 (3-3)   Implementation of systems programs, concepts of computer operating systems; laboratory experience in using operating system facilities. Taught in Java programming language. Typically offered Fall and Spring.", "prereq": "CPT S 233 with a C or better; CPT S 260 with a C or better or E E 234 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["401  Computers and Society"], "description": "3   Skills and literacy course. Ethical and societal issues related to computers and computer networks; computers as enabling technology; computer crime, software theft, privacy, viruses, worms. Credit not granted for both CPT S 401 and CPT S/E E 302.", "prereq": "CPT S 215, 223, or 233; admitted to a major in EECS or Data Analytics; junior standing"},
{"major": "CPT_S", "name": ["411  Introduction to Parallel Computing"], "description": "3   Fundamental principles of parallel computing, parallel programming experience on multicore machines and cluster computers, and design of algorithms and applications in parallel computing. Recommended preparation: CPT S 350. Typically offered Fall.", "prereq": "CPT S 215, 223, or 233, with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["415  Big Data"], "description": "3   Big data models, databases and query languages, modern distributed database systems and algorithms. (Crosslisted course offered as CPT S 415, CS 415).", "prereq": "CPT S 215, 223, or 233, with a C or better; admitted to the major or minor in Computer Science, Computer Engineering, Electrical Engineering, Software Engineering, Data Analytics, or Cybersecurity"},
{"major": "CPT_S", "name": ["421  Software Design Project I"], "description": "3 (1-6)    Large-scale software development including requirements analysis, estimation, design, verification and project management. Typically offered Fall and Spring.", "prereq": "C or better in CPT S 321 and 322; or C or better in CPT S 322 and CPT S 360 or 370; or C or better CPT S 322 and concurrent enrollment in CPT S 360 or 370; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["422 [M]  Software Engineering Principles II"], "description": "3    Dependable software systems; software verification and validation, testing; CASE environments; software management and evolution. Typically offered Fall.", "prereq": "CPT S 321 with a C or better or CPT S 323 with a C or better; CPT S 322 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["423 [CAPS] [M]  Software Design Project II"], "description": "3 (1-6)    Laboratory/group design project for large-scale software development, requirements analysis, estimation, design, verification techniques. Typically offered Fall and Spring.", "prereq": "CPT S 421 with a C or better; admitted to a major or minor in EECS or Data Analytics; junior standing"},
{"major": "CPT_S", "name": ["424  Cyber Law, Ethics, Rights, and Policies"], "description": "3   Laws, ethics, rights, and governmental regulations as applied to the field of cybersecurity from technological and social perspectives. Typically offered Spring.", "prereq": "CPT S 327 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["425  Cyber Forensics and Anti-Forensics"], "description": "3   Recovery and investigation of material found in various cyber environments (e.g., device, memory, operating systems, etc.) and ways to defeat forensic processes and tools. Typically offered Fall.", "prereq": "CPT S 327 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["426  Hardware, Hardware Security, and Hardware Reverse Engineering"], "description": "3   Hardware hacking and reverse engineering approaches routinely used against electronic devices and embedded systems; introduction to the basic procedures necessary to perform reverse engineering of hardware components to determine their functionality, inputs, outputs, and stored data. Typically offered Spring.", "prereq": "CPT S 327 with a C or better; CPT S 439 with a C or better or concurrent enrollment; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["427  Cyber Security of Wireless and Distributed Systems"], "description": "3   Cellular and wireless system security, incidence response cycles, fault tolerance, and distributed computer security. Typically offered Spring.", "prereq": "CPT S 327 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["428  Software Security and Reverse Engineering"], "description": "3   Key aspects of cyber security with an emphasis on software and systems security focusing on concepts, principles, methodologies, and techniques for measuring and defending the various security properties of both operating systems and application software. Credit not granted for both CPT S 428 and CPT S 528. Offered at 400 and 500 level. Typically offered Spring.", "prereq": "CPT S 327 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["429  Virtualization and Offensive Cyber Operations"], "description": "3   Virtualization and offensive cyber operations including the building of multiple software systems that operate as independent systems running on multiple native hardware items and conducting campaigns aimed at compromising computational capacities of an adversary. Typically offered Fall.", "prereq": "CPT S 327 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["430  Numerical Analysis"], "description": "3   Fundamentals of numerical computation; finding zeroes of functions, approximation and interpolation; numerical integration (quadrature); numerical solution of ordinary differential equations. (Crosslisted course offered as MATH 448, MATH 548, CPT S 430, CPT S 530). Required preparation must include differential equations and a programming course. Offered at 400 and 500 level. Typically offered Fall and Spring.", "prereq": "MATH 315 with a C or better; one of CPT S 121, 131, or MATH 300, with a C or better"},
{"major": "CPT_S", "name": ["431  Security Analytics and DevSecOps"], "description": "3   Security analytics at an enterprise deployment scale using social, data, graph avenues of evaluation, and topics of supply chain cybersecurity, risk management frameworks, and security of developer operation pipelines. Typically offered Spring.", "prereq": "CPT S 327 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["432 [CAPS] [M]  Cybersecurity Capstone Project"], "description": "3   Group design project for large-scale cybersecurity development incorporating analysis, application ability, industrial skills, and adherence to cybersecurity standards. Typically offered Spring.", "prereq": "CPT S 327; CPT S 427; CPT S 428; CPT S 455, each with a C or better; admitted to the major in Cybersecurity; senior standing"},
{"major": "CPT_S", "name": ["434  Neural Network Design and Application"], "description": "3    Hands-on experience with neural network modeling of nonlinear phenomena; application to classification, forecasting, identification and control. Credit not granted for both CPT S 434 and CPT S 534. Offered at 400 and 500 level.", "prereq": "CPT S 121, 131, or E E 221, with a C or better; STAT 360 with a C or better; admitted to a major or minor in EECS or Data Analytics, or major in Neuroscience"},
{"major": "CPT_S", "name": ["437  Introduction to Machine Learning"], "description": "3   Topics in machine learning including linear models for regression and classification, generative models, support vector machines and kernel methods, neural networks and deep learning, decision trees, unsupervised learning, and dimension reduction. Recommended preparation: E E 221; linear algebra; multivariate calculus; probability and statistics. Typically offered Spring.", "prereq": "CPT S 215, 223, or 233, with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["438  Scientific Visualization"], "description": "3    Data taxonomy, sampling, plotting, using and extending a visualization package, designing visualization and domain-specific techniques.", "prereq": "CPT S 223 or 233, with a C or better; CPT S 224 with a C or better; MATH 172 or 182, with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["439  Cybersecurity of Critical Infrastructure Systems"], "description": "3   Security topics as they relate to critical infrastructure systems vital to any nation including industrial control systems, cyber physical systems, SCADA, DCS, IoT, IIoT, and the knowledge to secure such systems.  (Crosslisted course offered as E E 439, CPT S 439). Typically offered Spring.", "prereq": "CPT S 327 and 426 with a C or better or concurrent enrollment; admitted major or minor in EECS or Data Analytics; OR E E 234 and 361; admitted major or minor in E E; OR CPT S 327 and E E 234; admitted major or minor in Cpt Engr"},
{"major": "CPT_S", "name": ["440  Artificial Intelligence"], "description": "3    An introduction to the field of artificial intelligence including heuristic search, knowledge representation, deduction, uncertainty reasoning, learning, and symbolic programming languages. Credit not granted for both CPT S 440 and CPT S 540. Offered at 400 and 500 level. Typically offered Fall.", "prereq": "CPT S 223 or 233, with a C or better; admitted to a major or minor in EECS or Data Analytics, or major in Neuroscience"},
{"major": "CPT_S", "name": ["442  Computer Graphics"], "description": "3    Raster operations; transformations and viewing; geometric modeling; visibility and shading; color. Credit not granted for both CPT S 442 and CPT S 542. Offered at 400 and 500 level. Cooperative: Open to UI degree-seeking students.", "prereq": "CPT S 223 with a C or better; CPT S 224 with a C or better or CPT S 360 with a C or better; MATH 220 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["443  Human-Computer Interaction"], "description": "3    Concepts and methodologies of engineering, social and behavioral sciences to address ergonomic, cognitive, social and cultural factors in the design and evaluation of human-computer systems. Credit not granted for both CPT S 443 and CPT S 543. Offered at 400 and 500 level. Typically offered Spring.", "prereq": "CPT S 223 or 233; admitted to a major or minor in EECS or Data Analytics, or major in Neuroscience; junior standing"},
{"major": "CPT_S", "name": ["451  Introduction to Database Systems"], "description": "3    Introduction to database concepts, data models, database languages, database design, implementation issues. Typically offered Spring.", "prereq": "CPT S 215, 223, or 233, with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["452  Compiler Design"], "description": "3    Design of lexical analyzers, syntactic analyzers, intermediate code generators, code optimizers and object code generators.", "prereq": "CPT S 317 with a C or better; CPT S 355 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["453  Graph Theory"], "description": "3   Graphs and their applications, directed graphs, trees, networks, Eulerian and Hamiltonian paths, matrix representations, construction of algorithms. (Crosslisted course offered as MATH 453, CPT S 453). Required preparation must include linear algebra.  Recommended preparation: MATH 301. Typically offered Fall. Cooperative: Open to UI degree-seeking students.", "prereq": "MATH 220, 225, or 230"},
{"major": "CPT_S", "name": ["455  Introduction to Computer Networks and Security"], "description": "3   Concepts and implementations of computer networks; architectures, protocol layers, internetworking, addressing case studies, and discussion of security constraints at all layers of the OSI stack from attacker and defender perspectives. (Crosslisted course offered as CPT S 455, E E 455). Typically offered Fall.", "prereq": "CPT S 360, 370, or E E 234, with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["460  Operating Systems and Computer Architecture"], "description": "3    Operating systems, computer architectures, and their interrelationships in micro, mini, and large computer systems. Typically offered Fall and Spring.", "prereq": "CPT S 360 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["464  Distributed Systems Concepts and Programming"], "description": "3    Concepts of distributed systems; naming, security, networking, replication, synchronization, quality of service; programming middleware. Credit not granted for both CPT S 464 and CPT S 564. Offered at 400 and 500 level. Typically offered Spring. Cooperative: Open to UI degree-seeking students.", "prereq": "CPT S 223, 233, or E E 234, with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["466  Embedded Systems"], "description": "3 (2-3)    The design and development of real-time and dedicated software systems with an introduction to sensors and actuators. Credit not granted for both CPT S 466 and CPT S 566. Offered at 400 and 500 level. Cooperative: Open to UI degree-seeking students.", "prereq": "CPT S 360 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["471  Computational Genomics"], "description": "3    Fundamental algorithms, techniques and applications. Credit not granted for both CPT S 471 and CPT S 571. Offered at 400 and 500 level. Typically offered Spring.", "prereq": "CPT S 223 or 233, with a C or better; CPT S 350 with a C or better or concurrent enrollment; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["475  Data Science"], "description": "3   The data science process, data wrangling, exploratory data analysis, linear regression, classification, clustering, principal components analysis, recommender systems, data visualization, data and ethics, and effective communication. Credit not granted for both CPT S 475 and CPT S 575.  Recommended preparation for 575: Familiarity with algorithm design and analysis, basic linear algebra, and basic probability and statistics. Offered at 400 and 500 level. Typically offered Fall.", "prereq": "CPT S 215, CPT S 223, or CPT S 233, with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["476  Software Construction and Maintenance"], "description": "3   Software quality, construction (API design and use, object-oriented runtime issues), and maintenance (refactoring, reengineering, reverse engineering).", "prereq": "CPT S 322 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["478  Software Process and Management"], "description": "3   Software Engineering Process (definition, assessment, and improvement); Software Engineering Management; Software Configuration Management.", "prereq": "CPT S 322 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["479  Mobile Application Development"], "description": "3   Mobile application development; user interface; location and maps; sensor; camera; cross platform mobile application development tools.", "prereq": "CPT S 223 or 233, with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["480  Python Software Construction"], "description": "3   Intensive introduction to the python language; user interface, building and using extension modules; C interfacing; construction of a major project.  (Formerly CPT S 481.)", "prereq": "CPT S 223 with a C or better; CPT S 224 or CPT S 360 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["483  Topics in Computer Science"], "description": "V 1-4 May be repeated for credit.   Required background preparation varies with course offering, see instructor.  Current topics in computer science or software engineering.", "prereq": "Admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["484  Software Requirements"], "description": "3   Elicitation, analysis, specification, and validation of software requirements as well as the management of requirements during the software life cycle.", "prereq": "CPT S 322 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["485  Gerontechnology I"], "description": "3   Introduction to the field of gerontechnology, including aging and senses, mobility and exercise, data analysis, and research methods. (Crosslisted course offered as CPT S 485, PSYCH 485). Typically offered Fall.", "prereq": " CPT S 215, 223, or 233; admitted to a major or minor in EECS or Data Analytics, or major in Psychology"},
{"major": "CPT_S", "name": ["486  Gerontechnology II"], "description": "3   In-depth exploration of gerontechnology, including socialization, caregiver issues, dementia, app design and data visualization. (Crosslisted course offered as CPT S 486, PSYCH 486). Typically offered Spring.", "prereq": " CPT S 215, 223, or 233; admitted to a major or minor in EECS or Data Analytics, or major in Psychology"},
{"major": "CPT_S", "name": ["487  Software Design and Architecture"], "description": "3   Enrollment not allowed if credit already earned for CPT S 323.  Software design; design principles, patterns, and anti-patterns; design quality attributes and evaluation; architectural styles, architectural patterns and anti-patterns.  Credit not granted for both CPT S 487 and CPT S 587, or for both CPT S 487 and 323. Offered at 400 and 500 level.", "prereq": "CPT S 321 with a C or better; CPT S 322 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["488  Professional Practice Coop/Internship I"], "description": "V 1-2 May be repeated for credit; cumulative maximum 6 credits.   Practicum for students admitted to the VCEA Professional Practice and Experiential Learning Program; integration of coursework with on-the-job professional experience. (Crosslisted course offered as ENGR 488, BIO ENG 488, CHE 488, CE 488, CPT S 488, E E 488, ME 488, MSE 488, SDC 488). Typically offered Fall, Spring, and Summer.                                                                   S, F grading.", "prereq": "By department permission"},
{"major": "CPT_S", "name": ["489  Web Development"], "description": "3   Web development using markup languages, style sheet language, and scripting languages; developing and consuming web services; testing web applications.", "prereq": "CPT S 322 with a C or better; admitted to a major or minor in EECS or Data Analytics"},
{"major": "CPT_S", "name": ["490  Work Study Internship"], "description": "V 1-9 May be repeated for credit; cumulative maximum 9 credits.    Experience in programming and systems analysis in a working environment under supervision of industrial or governmental professionals and faculty.  Typically offered Fall, Spring, and Summer.                                                                   S, F grading.", "prereq": " By department permission only; Computer Science major"},
{"major": "CPT_S", "name": ["499  Special Problems"], "description": "V 1-4 May be repeated for credit.   Independent study conducted under the jurisdiction of an approving faculty member; may include independent research studies in technical or specialized problems; selection and analysis of specified readings; development of a creative project; or field experiences. Typically offered Fall, Spring, and Summer.                                                                   S, F grading.", "prereq": "By department permission"},
{"major": "CPT_S", "name": ["500  Proseminar"], "description": "1    Faculty research interests, departmental computer systems, computer science research, report preparation.  Typically offered Fall.                                                                   S, F grading."},
{"major": "CPT_S", "name": ["515  Advanced Algorithms"], "description": "3   Advanced algorithms and data structures, design and analysis, intractability.  (Crosslisted course offered as CPT S 515, CS 515.)"},
{"major": "CPT_S", "name": ["516  Algorithmics"], "description": "3    Discrete structures, automata, formal languages, recursive functions, algorithms, and computability. Typically offered Spring."},
{"major": "CPT_S", "name": ["527  Computer Security"], "description": "3   Examines cyber vulnerabilities and attacks against computer systems and networks; includes security protection mechanisms, cryptography, secure communication protocols, information flow enforcement, network monitoring, and anonymity techniques."},
{"major": "CPT_S", "name": ["528  Software Security and Reverse Engineering"], "description": "3   Key aspects of cyber security with an emphasis on software and systems security focusing on concepts, principles, methodologies, and techniques for measuring and defending the various security properties of both operating systems and application software. Credit not granted for both CPT S 428 and CPT S 528. Offered at 400 and 500 level. Typically offered Spring."},
{"major": "CPT_S", "name": ["530  Numerical Analysis"], "description": "3   Fundamentals of numerical computation; finding zeroes of functions, approximation and interpolation; numerical integration (quadrature); numerical solution of ordinary differential equations. (Crosslisted course offered as MATH 448, MATH 548, CPT S 430, CPT S 530). Required preparation must include differential equations and a programming course. Offered at 400 and 500 level. Typically offered Fall and Spring."},
{"major": "CPT_S", "name": ["531  Advanced Matrix Computations"], "description": "3   Advanced topics in the solution of linear systems, singular value decomposition, and computation of eigenvalues and eigenvectors (Francis's algorithm). (Crosslisted course offered as MATH 544, CPT S 531). Required preparation must include numerical analysis. Typically offered Even Years - Fall. Cooperative: Open to UI degree-seeking students."},
{"major": "CPT_S", "name": ["534  Neural Network Design and Application"], "description": "3    Hands-on experience with neural network modeling of nonlinear phenomena; application to classification, forecasting, identification and control. Credit not granted for both CPT S 434 and CPT S 534. Offered at 400 and 500 level."},
{"major": "CPT_S", "name": ["538  Scientific Visualization"], "description": "3    Data taxonomy; sampling; plotting; using and extending a visualization package; designing visualizations; domain-specific techniques."},
{"major": "CPT_S", "name": ["540  Artificial Intelligence"], "description": "3    An introduction to the field of artificial intelligence including heuristic search, knowledge representation, deduction, uncertainty reasoning, learning, and symbolic programming languages. Credit not granted for both CPT S 440 and CPT S 540. Offered at 400 and 500 level. Typically offered Fall."},
{"major": "CPT_S", "name": ["542  Computer Graphics"], "description": "3    Raster operations; transformations and viewing; geometric modeling; visibility and shading; color. Credit not granted for both CPT S 442 and CPT S 542. Offered at 400 and 500 level. Cooperative: Open to UI degree-seeking students."},
{"major": "CPT_S", "name": ["543  Human-Computer Interaction"], "description": "3    Concepts and methodologies of engineering, social and behavioral sciences to address ergonomic, cognitive, social and cultural factors in the design and evaluation of human-computer systems. Credit not granted for both CPT S 443 and CPT S 543. Offered at 400 and 500 level. Typically offered Spring."},
{"major": "CPT_S", "name": ["548  Advanced Computer Graphics"], "description": "3    Solid modeling, visual realism, light and color models, advanced surface generation techniques."},
{"major": "CPT_S", "name": ["550  Parallel Computation"], "description": "3    Parallel machine models, principles for the design of parallel algorithms, interconnection networks, systolic arrays, computational aspects to VLSI. Required preparation must include differential equations and a programming course. Typically offered Spring."},
{"major": "CPT_S", "name": ["554  Advanced Graph Theory"], "description": "3   Advanced treatment of the theory of graphs including matchings, colorings, extremal graph theory, graph algorithms, algebraic and spectral methods, and random graph models. Required preparation: MATH 453 or equivalent.  (Crosslisted course offered as MATH 554, CPT S 554). Typically offered Fall. Cooperative: Open to UI degree-seeking students."},
{"major": "CPT_S", "name": ["555  Computer Communication Networks"], "description": "3    Packet switching networks; multi-access and local-area networks; delay models in data networks; routing and flow control. (Crosslisted course offered as E E 555, CPT S 555). Typically offered Spring."},
{"major": "CPT_S", "name": ["557  Advanced Computer Networks"], "description": "3    ATM networks, optical WDM networks, and wireless/mobile networks; access, transport, and routing protocols."},
{"major": "CPT_S", "name": ["560  Operating Systems"], "description": "3    Structure of multiprogramming and multiprocessing; efficient allocation of systems resources; design implementation and performance measurement. Typically offered Fall."},
{"major": "CPT_S", "name": ["561  Advanced Computer Architecture"], "description": "3   Instruction set architectures, pipelining and super pipelining, instruction level parallelism, superscalar and VLIW processors, cache memory, thread-level parallelism and VLSI. (Crosslisted course offered as E E 524, CPT S 561). Typically offered Fall."},
{"major": "CPT_S", "name": ["562  Fault Tolerant Computer Systems"], "description": "3    Fault tolerance aspects involved in design and evaluation of systems; methods of detection and recovery; multicast, middleware, and reconfiguration. (Crosslisted course offered as CPT S 562, E E 562)."},
{"major": "CPT_S", "name": ["564  Distributed Systems Concepts and Programming"], "description": "3    Concepts of distributed systems; naming, security, networking, replication, synchronization, quality of service; programming middleware. Credit not granted for both CPT S 464 and CPT S 564. Offered at 400 and 500 level. Typically offered Spring. Cooperative: Open to UI degree-seeking students."},
{"major": "CPT_S", "name": ["566  Embedded Systems"], "description": "3 (2-3)    The design and development of real-time and dedicated software systems with an introduction to sensors and actuators. Credit not granted for both CPT S 466 and CPT S 566. Offered at 400 and 500 level. Cooperative: Open to UI degree-seeking students."},
{"major": "CPT_S", "name": ["570  Machine Learning"], "description": "3    Introduction to building computer systems that learn from their experience; classification and regression problems; unsupervised and reinforcement learning. Typically offered Fall."},
{"major": "CPT_S", "name": ["571  Computational Genomics"], "description": "3    Fundamental algorithms, techniques and applications. Credit not granted for both CPT S 471 and CPT S 571. Offered at 400 and 500 level. Typically offered Spring."},
{"major": "CPT_S", "name": ["572  Numerical Methods in Computational Biology"], "description": "3    Computational methods for solving scientific problems related to information processing in biological systems at the molecular and cellular levels."},
{"major": "CPT_S", "name": ["573  Bioinformatics Software Development"], "description": "3    Provides programming skills needed to address current computational problems in bioinformatics; emphasis on mathematical development and software design."},
{"major": "CPT_S", "name": ["575  Data Science"], "description": "3   The data science process, data wrangling, exploratory data analysis, linear regression, classification, clustering, principal components analysis, recommender systems, data visualization, data and ethics, and effective communication. Credit not granted for both CPT S 475 and CPT S 575.  Recommended preparation for 575: Familiarity with algorithm design and analysis, basic linear algebra, and basic probability and statistics. Offered at 400 and 500 level. Typically offered Fall."},
{"major": "CPT_S", "name": ["577  Structured Prediction: Algorithms and Applications"], "description": "3   Machine learning algorithms to predict structured outputs from structured inputs for diverse applications, including: natural language processing, computer vision, social networks, smart environments, and computer engineering. Typically offered Spring."},
{"major": "CPT_S", "name": ["580  Advanced Topics in Computer Science"], "description": "3 May be repeated for credit."},
{"major": "CPT_S", "name": ["581  Software Maintenance"], "description": "3   Software maintenance, refactoring, reengineering, reverse engineering."},
{"major": "CPT_S", "name": ["582  Software Testing"], "description": "3   Software testing, testing levels, testing objectives, testing techniques."},
{"major": "CPT_S", "name": ["583  Software Quality"], "description": "3   Software quality, quality assurance, process and product quality, software measures, quality attributes, quality management."},
{"major": "CPT_S", "name": ["587  Software Design and Architecture"], "description": "3   Software design; design principles, patterns, and anti-patterns; design quality attributes and evaluation; architectural styles, architectural patterns and anti-patterns.  Credit not granted for both CPT S 487 and CPT S 587, or for both CPT S 487 and 323. Offered at 400 and 500 level. Typically offered Fall and Spring."},
{"major": "CPT_S", "name": ["591  Elements of Network Science"], "description": "3   Fundamental elements of the emerging science of complex networks, with emphasis on social and information networks. Recommended preparation: CPT S 350 with a C or better. Typically offered Spring."},
{"major": "CPT_S", "name": ["595  Directed Study in Computer Science"], "description": "V 1 (0-3) to 3 (0-9) May be repeated for credit; cumulative maximum 6 credits.    Current topics in computer science.  Typically offered Fall and Spring."},
{"major": "CPT_S", "name": ["600  Special Projects or Independent Study"], "description": "V 1-18 May be repeated for credit.   Independent study, special projects, and/or internships. Students must have graduate degree-seeking status and should check with their major advisor before enrolling in 600 credit, which cannot be used toward the core graded credits required for a graduate degree. Typically offered Fall, Spring, and Summer.                                                                   S, F grading."},
{"major": "CPT_S", "name": ["700  Master's Research, Thesis, and/or Examination"], "description": "V 1-18 May be repeated for credit.   Independent research and advanced study for students working on their master's research, thesis and/or final examination. Students must have graduate degree-seeking status and should check with their major advisor/committee chair before enrolling for 700 credit. Typically offered Fall, Spring, and Summer.                                                                   S, U grading."},
{"major": "CPT_S", "name": ["702  Master's Special Problems, Directed Study, and/or Examination"], "description": "V 1-18 May be repeated for credit.   Independent research in special problems, directed study, and/or examination credit for students in a non-thesis master's degree program.  Students must have graduate degree-seeking status and should check with their major advisor/committee chair before enrolling for 702 credit. Typically offered Fall, Spring, and Summer.                                                                   S, U grading.", "prereq": "By department permission"},
{"major": "CPT_S", "name": ["800  Doctoral Research, Dissertation, and/or Examination"], "description": "V 1-18 May be repeated for credit.   Independent research and advanced study for students working on their doctoral research, dissertation and/or final examination. Students must have graduate degree-seeking status and should check with their major advisor/committee chair before enrolling for 800 credit.  (Crosslisted course offered as CPT S 800, CS 800). Typically offered Fall, Spring, and Summer.                                                                   S, U grading.", "prereq": " Admitted to the Computer Science PhD program"}
]